Revit 2027 API
PlanCircuitSet.Insert Method
Insert the specified item into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	PlanCircuit item
)
Public Overridable Function Insert (
	item As PlanCircuit
) As Boolean
public:
virtual bool Insert(
	PlanCircuit^ item
)
abstract Insert :
        item : PlanCircuit -> bool
override Insert :
        item : PlanCircuit -> bool
Parameters
item PlanCircuit
The item to be inserted into the set.
Return Value
Boolean
Returns whether the item was inserted into the set.
See Also
Reference
PlanCircuitSet Class
Autodesk.Revit.DB Namespace